faronov/cc2530-zigbee/tests/test_zcl_basic.c
static uint16_t exact_reads(void)
{
    static const uint8_t sizes[] = {5, 22, 20, 5, 13, 6};
    uint8_t expected[100], *input, *output;
    zcl_dispatch_info_t *out = malloc(sizeof(*out));
    unsigned cap, n, i, used, source, count;
    CHECK(out != NULL);
    /* Every complete prefix, empty list and half-ID truncation in exact RAM. */
    for (n = 3; n <= sizeof(read_all); n++) {
        input = malloc(n);
        CHECK(input != NULL);
        memcpy(input, read_all, n);
        for (cap = 0; cap <= 102; cap++) {
            output = malloc(cap ? cap : 1);
            CHECK(output != NULL);
            memset(output, 0xc7, cap);
            memset(out, 0xa5, sizeof(*out));
            if (n == 3 || !(n & 1u)) {
                if (cap < 5) {
                    CHECK(zcl_dispatch_unicast(&basic.set, input, (uint16_t)n, output, (uint16_t)cap, out)
                          == ZCL_CODEC_BUFFER_TOO_SMALL);
                    CHECK(filled(output, (uint16_t)cap, 0xc7) && filled(out, sizeof(*out), 0xa5));
                } else {
                    CHECK(zcl_dispatch_unicast(&basic.set, input, (uint16_t)n, output, (uint16_t)cap, out) == ZCL_CODEC_OK);
                    CHECK(out->length == 5 && memcmp(output, "\x18\x5a\x0b\x00\x80", 5) == 0);
                    CHECK(filled(output + 5, (uint16_t)(cap - 5), 0xc7));
                }
            } else if (cap < 6) {
                CHECK(zcl_dispatch_unicast(&basic.set, input, (uint16_t)n, output, (uint16_t)cap, out)
                      == ZCL_CODEC_BUFFER_TOO_SMALL);
                CHECK(filled(output, (uint16_t)cap, 0xc7) && filled(out, sizeof(*out), 0xa5));
            } else {
                memcpy(expected, "\x18\x5a\x01", 3);
                used = source = 3; count = 0;
                for (i = 0; i < (n - 3) / 2 && used + 3 <= cap; i++) {
                    if (used + sizes[i] <= cap) {
                        memcpy(expected + used, read_golden + source, sizes[i]);
                        used += sizes[i];
                    } else {
                        memcpy(expected + used, read_golden + source, 2);
                        expected[used + 2] = 0x89;
                        used += 3;
                    }
                    source += sizes[i]; count++;
                }
                CHECK(zcl_dispatch_unicast(&basic.set, input, (uint16_t)n, output, (uint16_t)cap, out) == ZCL_CODEC_OK);
                CHECK(out->length == used && out->returned_count == count && out->requested_count == (n - 3) / 2);
                CHECK(memcmp(output, expected, used) == 0 && filled(output + used, (uint16_t)(cap - used), 0xc7));
            }
            CHECK(memcmp(input, read_all, n) == 0 && memcmp(&basic, &saved, sizeof(basic)) == 0);
            free(output);
        }
        free(input);
    }
    free(out);
    return 0;
}

static uint16_t exact_writes(void)
{
    static const uint8_t bytes[] = {0,0x5a,2,0,0,0x20,8,0xee};
    zcl_basic_t *model = malloc(sizeof(*model)), *before = malloc(sizeof(*before));
    zcl_dispatch_info_t *out = malloc(sizeof(*out));
    uint8_t *input, *output, expected[6];
    unsigned n, cap, command;
    zcl_codec_result_t rc, want;
    uint8_t used;
    CHECK(model != NULL && before != NULL && out != NULL);
    CHECK(zcl_basic_init(model, &lab) == ZCL_CODEC_OK);
    memcpy(before, model, sizeof(*model)); /* comparison only; do not use relocated self pointers */
    for (command = 2; command <= 5; command++) {
        if (command == 4) continue;
        for (n = 0; n <= sizeof(bytes); n++) {
            input = malloc(n ? n : 1);
            CHECK(input != NULL);
            memcpy(input, bytes, n);
            if (n > 2) input[2] = (uint8_t)command;
            for (cap = 0; cap <= 7; cap++) {
                output = malloc(cap ? cap : 1);
                CHECK(output != NULL);
                memset(output, 0xc7, cap ? cap : 1);
                memset(out, 0xa5, sizeof(*out));
                used = command == 5 ? 0 : n == 7 ? 6 : 5;
                want = n < 3 || (command == 5 && n != 7) ? ZCL_CODEC_TRUNCATED
                    : cap < used ? ZCL_CODEC_BUFFER_TOO_SMALL : ZCL_CODEC_OK;
                rc = zcl_dispatch_unicast(&model->set, input, (uint16_t)n, output, (uint16_t)cap, out);
                CHECK(rc == want && memcmp(model, before, sizeof(*model)) == 0);
                CHECK(memcmp(input, bytes, n < 2 ? n : 2) == 0);
                if (n > 2) CHECK(input[2] == command);
                if (n > 3) CHECK(memcmp(input + 3, bytes + 3, n - 3) == 0);
                if (rc != ZCL_CODEC_OK) {
                    CHECK(filled(output, (uint16_t)(cap ? cap : 1), 0xc7) && filled(out, sizeof(*out), 0xa5));
                } else {
                    CHECK(out->length == used && out->sequence == 0x5a);
                    if (command == 5) CHECK(memcmp(out, "\x02\x00\x00\x5a\x00\x00\x00\x00\x00\x00", 10) == 0);
                    else {
                        expected[0] = 0x18; expected[1] = 0x5a;
                        expected[2] = n == 7 ? 4 : 0x0b;
                        expected[3] = n == 7 ? 0x88 : (uint8_t)command;
                        expected[4] = n == 7 ? 0 : 0x80; expected[5] = 0;
                        CHECK(memcmp(output, expected, used) == 0 && out->kind == 0);
                    }
                    CHECK(filled(output + used, (uint16_t)((cap ? cap : 1) - used), 0xc7));
                }
                free(output);
            }
            free(input);
        }
    }
    free(out); free(before); free(model);
    return 0;
}

int main(void)
{
    uint16_t rc = run_tests();
    if (rc == 0) rc = exact_native();
    if (rc == 0) rc = exact_reads();
    if (rc == 0) rc = exact_writes();
    if (rc != 0) {
        fprintf(stderr, "Basic test failed at C line %u\n", rc);
        return 1;
    }
    printf("Basic: %u common cases; exact native allocations and real ZCL path PASS.\n", cases);
    return 0;
}
#endif
